backend/controllers/UserController.php

    public function actionIndex()
    {
        $searchModel = new UserSearch();
        $dataProvider = $searchModel->search($this->request->queryParams);
        $query = User::find();
        $users = $query->all();
---
SELECT * FROM `user`

    protected function findModel($id)
    {
        if (($model = User::findOne(['id' => $id])) !== null) {
---
SELECT * FROM `user` WHERE `id`='5'